proyecto_gomezmauricio/app/Models/Producto_model.php

SELECT *
FROM `productos`
ORDER BY RAND()
---
    public function obtenerProductosAlAzar($cantidad)
    {
        return $this->orderBy('RAND()')->limit($cantidad)->findAll();