proyecto_gomezmauricio/app/Views/front/catalogo.php

<?php
// Obtiene todas las categorías
$categoriaModel = new \App\Models\Categoria_model();
$categorias = $categoriaModel->findAll();
---
SELECT *
FROM `categorias`