proyecto_gomezmauricio/app/Controllers/Home.php

    public function catalogo()
    {
        $productoModel = new Producto_model();
        $categoriaModel = new Categoria_model();

        // Obtén todas las categorías
        $data['categorias'] = $categoriaModel->getCategorias();

        // Verifica si se ha seleccionado una categoría
        $categoriaSeleccionada = $this->request->getGet('categoria');

        // Obtén los productos según la categoría seleccionada
        if ($categoriaSeleccionada) {
            $data['productos'] = $productoModel->getProductsByCategory($categoriaSeleccionada);
        } else {
            // Si no hay categoría seleccionada, obtén todos los productos
            $data['productos'] = $productoModel->where('eliminado', 'NO')->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'